# Visualización de Datos Escolares
Este cuaderno muestra los datos de estudiantes y sus calificaciones de manera organizada para facilitar la comprensión.

In [ ]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("escuela.db")

## Tabla: Estudiantes

Obtenemos todos los datos de la tabla

In [8]:
df_estudiantes = pd.read_sql_query("SELECT * FROM estudiantes", conn)
df_estudiantes

   id        nombre  edad grado
0   1  Carlos Pérez    14    8º
1   2   María López    13    7º
2   3   Juan García    15    9º
3   4  Laura Torres    14    8º

## Tabla: Calificaciones

Obtenemos todos los valores de la segunda tabla

In [9]:
df_calificaciones = pd.read_sql_query("SELECT * FROM calificaciones", conn)
df_calificaciones

   id  estudiante_id      materia  nota
0   1              1  Matemáticas   8.5
1   2              1       Lengua   7.0
2   3              2  Matemáticas   9.0
3   4              2       Lengua   8.5
4   5              3  Matemáticas   6.0
5   6              3       Lengua   6.5
6   7              4  Matemáticas   8.0
7   8              4       Lengua   9.0

Así se filtran datos de una tabla

In [11]:
df_calificaciones_filtradas = pd.read_sql_query("SELECT estudiante_id, nota FROM calificaciones WHERE nota > 7.0",conn)
df_calificaciones_filtradas

   estudiante_id  nota
0              1   8.5
1              2   9.0
2              2   8.5
3              4   8.0
4              4   9.0

JOIN une el resultado de dos tablas y ON establece una condición para la unión

In [14]:
df_calificaciones_estudiante = pd.read_sql_query("""
SELECT estudiantes.nombre, calificaciones.materia, calificaciones.nota
FROM calificaciones 
JOIN estudiantes ON calificaciones.estudiante_id = estudiantes.id
WHERE estudiantes.nombre = 'Carlos Pérez';
""", conn)

df_calificaciones_estudiante

         nombre      materia  nota
0  Carlos Pérez  Matemáticas   8.5
1  Carlos Pérez       Lengua   7.0

Filtramos de forma negativa los resultados

In [16]:
df_calificaciones_estudiante = pd.read_sql_query("""
SELECT e.nombre, c.materia, c.nota
FROM calificaciones c
JOIN estudiantes e ON c.estudiante_id = e.id
WHERE e.nombre = 'Carlos Pérez' AND c.materia != 'Lengua';
""", conn)

df_calificaciones_estudiante

         nombre      materia  nota
0  Carlos Pérez  Matemáticas   8.5

In [18]:
df_calificaciones_estudiante = pd.read_sql_query("""
SELECT e.nombre, c.materia, c.nota
FROM calificaciones c
JOIN estudiantes e ON c.estudiante_id = e.id
WHERE e.nombre = 'Carlos Pérez' AND NOT c.materia = 'Lengua';
""", conn)

df_calificaciones_estudiante

         nombre      materia  nota
0  Carlos Pérez  Matemáticas   8.5

In [17]:
df_calificaciones_estudiante = pd.read_sql_query("""
SELECT e.nombre, c.materia, c.nota
FROM calificaciones c
JOIN estudiantes e ON c.estudiante_id = e.id
WHERE e.nombre = 'Carlos Pérez' AND c.materia = 'Lengua';
""", conn)

df_calificaciones_estudiante

         nombre materia  nota
0  Carlos Pérez  Lengua   7.0

Generamos un intervalo

In [20]:
df_calificaciones_estudiante = pd.read_sql_query("""
SELECT e.nombre, c.materia, c.nota
FROM calificaciones c
JOIN estudiantes e ON c.estudiante_id = e.id
WHERE c.materia = 'Lengua' AND (c.nota > 7.0 AND c.nota <= 8.5) ;
""", conn)

df_calificaciones_estudiante

        nombre materia  nota
0  María López  Lengua   8.5

Usamos OR para permitir que nos dé una cosa O la otra

In [21]:
df_calificaciones_estudiante = pd.read_sql_query("""
SELECT e.nombre, c.materia, c.nota
FROM calificaciones c
JOIN estudiantes e ON c.estudiante_id = e.id
WHERE e.nombre = 'Carlos Pérez' AND (c.materia = 'Matemáticas' OR c.materia = 'Inglés');
""", conn)

df_calificaciones_estudiante

         nombre      materia  nota
0  Carlos Pérez  Matemáticas   8.5

In [4]:
conn.close()